# Написать программу получающую набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ]

print('Введите целое число: ', end = '')
n = int(input())
number = 1

print(f'Произведения чисел от 1 до {n} = ', end = '')
for i in range(1, n + 1):
    number *= i
    print(number, end ='  ')